## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                |
|--------|------------------------------------|
| delete | `aws_ssm_parameter.mongodb_uri`    |
| add    | `aws_ssm_parameter.docdb_password` |
|        | `aws_ssm_parameter.docdb_username` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ssm_parameter.docdb_password will be created
  + resource "aws_ssm_parameter" "docdb_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "DocumentDB master password"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/docdb-password"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-docdb-password"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-docdb-password"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.docdb_username will be created
  + resource "aws_ssm_parameter" "docdb_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "DocumentDB master username"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/docdb-username"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-docdb-username"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-docdb-username"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.mongodb_uri will be destroyed
  # (because aws_ssm_parameter.mongodb_uri is not in configuration)
  - resource "aws_ssm_parameter" "mongodb_uri" {
      - arn             = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/mongodb-uri" -> null
      - data_type       = "text" -> null
      - description     = "MongoDB connection URI for feedback cronjob" -> null
      - id              = "/feedback-cronjob/staging/mongodb-uri" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/feedback-cronjob/staging/mongodb-uri" -> null
      - tags            = {
          - "Environment" = "staging"
          - "Name"        = "feedback-cronjob-mongodb-uri"
          - "Product"     = "feedback-cronjob"
        } -> null
      - tags_all        = {
          - "CostCentre"  = "feedback-cronjob-staging"
          - "Environment" = "staging"
          - "Name"        = "feedback-cronjob-mongodb-uri"
          - "Product"     = "feedback-cronjob"
          - "Terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + docdb_password_arn             = (known after apply)
  + docdb_password_name            = "/feedback-cronjob/staging/docdb-password"
  + docdb_username_arn             = (known after apply)
  + docdb_username_name            = "/feedback-cronjob/staging/docdb-username"
  - mongodb_uri_arn                = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/mongodb-uri" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.cra_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.google_service_account_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.health_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.ircc_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.travel_airtable_base"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
